# Part 2
Loveida Lucero

**Imports**

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

**Verifying string length for model creation**

In [2]:
basics = pd.read_csv('Data/basics.csv')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
# Calculate max string lenghts for object columns
tconst_length = basics['tconst'].fillna('').map(len).max()
tconst_length

10

In [4]:
# Calculate max string lenghts for object columns
title_length = basics['primaryTitle'].fillna('').map(len).max()
title_length

242

In [5]:
# Calculate max string lenghts for object columns
otitle_length = basics['originalTitle'].fillna('').map(len).max()
otitle_length

242

In [6]:
# Calculate max string lenghts for object columns
gconst_length = basics['genres'].fillna('').map(len).max()
gconst_length

29

In [7]:
ratings = pd.read_csv('Data/ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [8]:
# Calculate max string lenghts for object columns
tconst_length2 = basics['tconst'].fillna('').map(len).max()
tconst_length2

10

## Model ERD

![png](Data/Movie-ERD.png)

In [9]:
import json
with open('/Users/Lovei/.secret/mysql.json')as f:
    login = json.load(f)
    
login.keys()

dict_keys(['username', 'password'])

In [10]:
connection  = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [11]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [12]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

## Ratings

In [13]:
#display ratings csv info
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [14]:
#display ratings db info
q = '''DESCRIBE ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

             Field         Type Null  Key Default Extra
0           tconst  varchar(12)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [15]:
# display rating db columns
describe_r['Field'].values

array(['tconst', 'average_rating', 'number_of_votes'], dtype=object)

In [16]:
# display ratings csv columns
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [17]:
# rename columns to match db
rename_rating = {'averageRating':'average_rating', 
                'numVotes':'number_of_votes'}
ratings = ratings.rename(rename_rating, axis=1)
ratings.head()

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [18]:
#Load ratings table
ratings.to_sql("ratings", engine, index=False, if_exists='append')

71900

In [19]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

## Genres

In [20]:
q = '''DESCRIBE genres;'''
describe_g = pd.read_sql(q, conn)
describe_g

  Field         Type Null  Key Default           Extra
0    id          int   NO  PRI    None  auto_increment
1  name  varchar(30)  YES         None

In [21]:
describe_g['Field'].values

array(['id', 'name'], dtype=object)

In [22]:
# pull genres columns from basics csv to the new genres table
genres = basics['genres']

In [23]:
genres

0           Comedy,Fantasy,Romance
1                            Drama
2                            Drama
3             Comedy,Horror,Sci-Fi
4                            Drama
                   ...
86974                        Drama
86975         Comedy,Drama,Fantasy
86976                        Drama
86977    Action,Adventure,Thriller
86978                Drama,History
Name: genres, Length: 86979, dtype: object

In [24]:
# ??? Why no column name
#genres.columns

## Basics

In [25]:
q = '''DESCRIBE title_basics;'''
describe_tb= pd.read_sql(q, conn)
describe_tb

            Field          Type Null  Key Default Extra
0          tconst   varchar(12)   NO  PRI    None
1   primary_title  varchar(250)  YES         None
2      start_year           int  YES         None
3         runtime           int  YES         None
4  ratings_tconst   varchar(12)   NO         None

In [26]:
# view database columns
describe_tb['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime',
       'ratings_tconst'], dtype=object)

In [27]:
# view csv columns
basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [28]:
#remove all columns not in database
basics = basics.drop(columns= ['titleType','originalTitle','isAdult','endYear','genres']) 
basics.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes'], dtype='object')

In [29]:
#rename columns to match database
rename_basic = {'primaryTitle':'primary_title', 
               'startYear':'start_year', 
               'runtimeMinutes':'runtime'}
basics = basics.rename(rename_basic, axis=1)
basics.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [30]:
basics.dtypes

tconst            object
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [31]:
# change float to int for start_year
basics['start_year'] = basics['start_year'].astype(int)
basics['start_year'].dtype

dtype('int32')

In [32]:
# WHY WON'T IT INSERT DATA WHEN A COLUMN IS EMPTY? IS THE FOREIGN KEY FOR THE CONNECTION IN THE WRONG TABLE?
# Load basics table
#basics.to_sql("title_basics", engine, index=False, if_exists='append')

OperationalError: (pymysql.err.OperationalError) (1364, "Field 'ratings_tconst' doesn't have a default value")
[SQL: INSERT INTO title_basics (tconst, primary_title, start_year, runtime) VALUES (%(tconst)s, %(primary_title)s, %(start_year)s, %(runtime)s)]
[parameters: ({'tconst': 'tt0035423', 'primary_title': 'Kate & Leopold', 'start_year': 2001, 'runtime': 118}, {'tconst': 'tt0062336', 'primary_title': 'The Tango of the Widower and Its Distorting Mirror', 'start_year': 2020, 'runtime': 70}, {'tconst': 'tt0069049', 'primary_title': 'The Other Side of the Wind', 'start_year': 2018, 'runtime': 122}, {'tconst': 'tt0088751', 'primary_title': 'The Naked Monster', 'start_year': 2005, 'runtime': 100}, {'tconst': 'tt0096056', 'primary_title': 'Crime and Punishment', 'start_year': 2002, 'runtime': 126}, {'tconst': 'tt0100275', 'primary_title': 'The Wandering Soap Opera', 'start_year': 2017, 'runtime': 80}, {'tconst': 'tt0103340', 'primary_title': 'Life for Life: Maximilian Kolbe', 'start_year': 2006, 'runtime': 90}, {'tconst': 'tt0108549', 'primary_title': 'West from North Goes South', 'start_year': 2004, 'runtime': 96}  ... displaying 10 of 86979 total bound parameter sets ...  {'tconst': 'tt9916190', 'primary_title': 'Safeguard', 'start_year': 2020, 'runtime': 95}, {'tconst': 'tt9916362', 'primary_title': 'Coven', 'start_year': 2020, 'runtime': 92})]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Title_Genres

In [26]:
q = '''DESCRIBE title_genres;'''
describe_tg = pd.read_sql(q, conn)
describe_tg

                 Field         Type Null Key Default Extra
0  title_basics_tconst  varchar(12)   NO        None
1            genres_id          int   NO        None

## Confirm Database Updates

In [33]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [34]:
q = '''DESCRIBE title_genres;'''
describe_tg = pd.read_sql(q, conn)
describe_tg

                 Field         Type Null Key Default Extra
0  title_basics_tconst  varchar(12)   NO        None
1            genres_id          int   NO        None

In [36]:
q = '''DESCRIBE title_basics;'''
describe_tb = pd.read_sql(q, conn)
describe_tb

            Field          Type Null  Key Default Extra
0          tconst   varchar(12)   NO  PRI    None
1   primary_title  varchar(250)  YES         None
2      start_year           int  YES         None
3         runtime           int  YES         None
4  ratings_tconst   varchar(12)   NO  PRI    None

In [33]:
q = '''DESCRIBE genres;'''
describe_g = pd.read_sql(q, conn)
describe_g

  Field         Type Null  Key Default           Extra
0    id          int   NO  PRI    None  auto_increment
1  name  varchar(30)  YES         None

In [34]:
q = '''DESCRIBE ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

             Field         Type Null  Key Default Extra
0           tconst  varchar(12)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [36]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [35]:
# Confirm data has been added
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [id, name]
Index: []

In [37]:
# Confirm data has been added
q = """
SELECT * FROM title_basics
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [tconst, primary_title, start_year, runtime, ratings_tconst]
Index: []

In [39]:
# Confirm data has been added
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [title_basics_tconst, genres_id]
Index: []